app/controllers/libros_controller.rb

  def index
    @libros = Libro.all
---
SELECT * FROM `libros`

  def show
    @libro = Libro.find(params[:id])
---
SELECT * FROM `libros` WHERE (`libros`.`id` = 1)

  def edit
    @libro = Libro.find(params[:id])
---
SELECT * FROM `libros` WHERE (`libros`.`id` = 1)

  def create
    @libro = Libro.new(params[:libro])

    respond_to do |format|
      if @libro.save
---
INSERT INTO `libros` (`created_at`, `front_content_type`, `titulo`, `autor`, `updated_at`, `front_file_size`, `edicion`, `front_file_name`, `front_updated_at`, `year`, `editorial`) VALUES('2010-11-19 15:12:43', 'image/jpeg', '', '', '2010-11-19 15:12:43', 514480, '', 'salsa-en-la-calle-homenaje-al-cantante.jpg', '2010-11-19 15:12:42', NULL, '')

  def update
    @libro = Libro.find(params[:id])

    respond_to do |format|
      if @libro.update_attributes(params[:libro])
---
SELECT * FROM `libros` WHERE (`libros`.`id` = 1)
UPDATE `libros` SET `updated_at` = '2010-11-19 15:27:13', `front_updated_at` = '2010-11-19 15:27:12', `front_content_type` = 'image/png', `front_file_size` = 2868032, `front_file_name` = 'ABSTRACT-AnotherBlue_1024x768.png' WHERE `id` = 2

  def destroy
    @libro = Libro.find(params[:id])
    @libro.destroy
---
SELECT * FROM `libros` WHERE (`libros`.`id` = 4)
DELETE FROM `libros` WHERE `id` = 4