app/controllers/paginas_controller.rb

  def index
    @pagina = Pagina.all(:order=> "media_file_name ASC")
---
SELECT * FROM `paginas` ORDER BY media_file_name ASC

  def show
    @pagina = Pagina.find(params[:id])
---
SELECT * FROM `paginas` WHERE (`paginas`.`id` = 1)

  def create
    #@libro=Libro.find(params[:libro_id])
    @pagina = Pagina.new(params[:pagina])
    if @pagina.save
---
INSERT INTO `paginas` (`created_at`, `media_file_size`, `updated_at`, `libro_id`, `media_content_type`, `nropagina`, `media_file_name`, `media_updated_at`) VALUES('2010-11-21 01:20:30', NULL, '2010-11-21 01:20:30', 2, NULL, '3', NULL, NULL)

  def edit
    @pagina = Pagina.find(params[:id])
---
SELECT * FROM `paginas` WHERE (`paginas`.`id` = 4)

  def update
    @pagina = Pagina.find(params[:id])
    if @pagina.update_attributes(params[:pagina])
---
SELECT * FROM `paginas` WHERE (`paginas`.`id` = 4)
UPDATE `paginas` SET `updated_at` = '2010-11-19 16:22:37', `nropagina` = 'pagina del libro 2' WHERE `id` = 4

  def destroy
    @pagina = Pagina.find(params[:id])
    @pagina.destroy
---
SELECT * FROM `paginas` WHERE (`paginas`.`id` = 29)
DELETE FROM `paginas` WHERE `id` = 29