app/controllers/tecnicas_controller.rb

SELECT * FROM `tecnicas`
---
  def index
    @tecnicas = Tecnica.all

SELECT * FROM `tecnicas` WHERE (`tecnicas`.`id` = 1)
---
  def show
    @tecnica = Tecnica.find(params[:id])

INSERT INTO `tecnicas` (`created_at`, `formato`, `updated_at`, `picture_content_type`, `picture_updated_at`, `id`, `picture_file_name`, `picture_file_size`) VALUES('2010-11-07 15:05:27', NULL, '2010-11-07 15:05:27', NULL, NULL, 3, NULL, NULL)
---
  def create
    @tecnica = Tecnica.new(params[:tecnica])
    if @tecnica.save

SELECT * FROM `tecnicas` WHERE (`tecnicas`.`id` = 7)
---
  def edit
    @tecnica = Tecnica.find(params[:id])

SELECT * FROM `tecnicas` WHERE (`tecnicas`.`id` = 7)
UPDATE `tecnicas` SET `updated_at` = '2010-11-07 03:06:12', `picture_file_size` = 249227, `picture_content_type` = 'application/pdf', `picture_file_name` = 'npsE42.pdf', `picture_updated_at` = '2010-11-07 03:06:07', `formato` = 'otra vaina' WHERE `id` = 7
---
  def update
    @tecnica = Tecnica.find(params[:id])
    if @tecnica.update_attributes(params[:tecnica])

SELECT * FROM `tecnicas` WHERE (`tecnicas`.`id` = 5)
DELETE FROM `tecnicas` WHERE `id` = 5
---
  def destroy
    @tecnica = Tecnica.find(params[:id])
    @tecnica.destroy