app/controllers/unitarios_controller.rb

  def index
    @unitarios = Unitario.all
---
SELECT * FROM `unitarios`

  def show
    @unitario = Unitario.find(params[:id])
---
SELECT * FROM `unitarios` WHERE (`unitarios`.`id` = 1)

  def create
    @unitario = Unitario.new(params[:unitario])
    if @unitario.save
---
INSERT INTO `unitarios` (`created_at`, `titulo`, `updated_at`, `mediau_content_type`, `mediau_file_name`, `mediau_file_size`, `mediau_updated_at`) VALUES('2010-11-23 14:20:17', 'subjuntivo', '2010-11-23 14:20:17', 'image/png', 'Pantallazo.png', 15525, '2010-11-23 14:20:17')

  def edit
    @unitario = Unitario.find(params[:id])
---
SELECT * FROM `unitarios` WHERE (`unitarios`.`id` = 1)

  def update
    @unitario = Unitario.find(params[:id])
---
SELECT * FROM `unitarios` WHERE (`unitarios`.`id` = 1)