app/controllers/users_controller.rb

  def index
    @user = User.all
---
SELECT * FROM `users`

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`skype`, `created_at`, `crypted_password`, `fechanacimiento`, `foto_file_size`, `updated_at`, `idioma`, `username`, `role`, `password_salt`, `ciudad`, `cargo`, `persistence_token`, `pais`, `foto_content_type`, `foto_file_name`, `status`, `nombreapellido`, `sexo`, `foto_updated_at`, `email`) VALUES(NULL, '2010-11-11 15:23:44', 'ba7474c36ce97a950e5572492380e685a4c3c7401f8aa4a6865b82d13cf75a5461292d9ec2adf7c38efd175f35234f55f7c64560a29c4185d41b4ad4bfcaa3b2', NULL, NULL, '2010-11-11 15:23:44', NULL, 'prueba', 'admin', 't9ngQwCEX74YvVcorhUt', NULL, NULL, 'bff448215230b564a1eb531f1c860a5af0b660d1bc55cd8ccb06a0ce1c0ea5e4dbc9656a8e55071456b758e889c98427e1e4ffc1beb593cd68cf79cb767a9ef7', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'prueba@gmail.com')

  def edit
    #@user = current_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def update
    #@user = current_user
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-11-09 16:43:09', `crypted_password` = 'a27e33eb56fe79aa9c6b5fa3cdba757a75bca80e1852f7ec833a8981b1a5bb31b6bbfb98437787ff12209bdc3e87e4d46ddbd45e45d82829d8abfe86b08b2b37', `password_salt` = 'fniNfXcGDW9vKPcqUp', `persistence_token` = 'a249160c5b3df855b3ef5200665840f7c7bab5e8c87d7704d3babb59aef2fdd0790f9524a74390768176a242f67b866d851d8aa0b7e95a32ee193556fa51180c' WHERE `id` = 4